// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
// - створити функцію яка обчислює та повертає площу кола з радіусом r
// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
// - створити функцію яка приймає масив та виводить кожен його елемент
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
//
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
//==============================================================================================================


// function square(a, b) {
//     return a * b;
// }
//
// console.log(square(5, 3));


//==============================================================================================================


// function square1(r) {
//     return 3.14 * (Math.pow(r, 2));
// }
//
// console.log(square1(5));


//==============================================================================================================


// function square2(h, r) {
//     return 3.14 * (r * 2) * h;
// }
//
// console.log(square2(5, 4));


//==============================================================================================================


// let  arr = [1, 2, 3, 4, 5, 6, 7, 8, 9];
//
// function ell(arr) {
//     for (const arrElement of arr) {
//         console.log(arrElement);
//     }
// }
//
// ell(arr)


//==============================================================================================================


// function par(z){
//     document.write(`<p>${z}</p>`);
// }
// par('hello world');


//==============================================================================================================


// function list(a, b, c) {
//     document.write(`<ul>`);
//     document.write(`<li>${a}</li>`);
//     document.write(`<li>${b}</li>`);
//     document.write(`<li>${c}</li>`);
//     document.write(`</ul>`);
// }
//
// list('text1', 'text2', 'text3');


//==============================================================================================================


// function list2(text, number) {
//     document.write(`<ul>`);
//         for (let i = 0; i < number; i++) {
//             document.write(`<li>${text}</li>`);
//         }
//     document.write(`</ul>`);
// }
//
// list2('okten', 10);


//==============================================================================================================


// let arr = [1, 2, 3, true, false, 'hello', 'okten'];
//
// function list3(arr) {
//     document.write("<ul>");
//     for (let i = 0; i < arr.length; i++) {
//         document.write(`<li>${arr[i]}</li>`)
//     }
//
//     document.write("</ul>");
// }
//
// list3(arr);


//==============================================================================================================


// let arr2 = [
//     {id: 123, name: 'Luke', age: 30},
//     {id: 234, name: 'Duke', age: 28},
//     {id: 345, name: 'Mike', age: 33},
//     {id: 456, name: 'Leon', age: 31},
// ];
//
// function list3(x) {
//     for (let i = 0; i < x.length; i++) {
//          document.write(`<div>${x[i].id} ${x[i].name} ${x[i].age}</div>`);
//     }
// }
//
// list3(arr2);